# üö¢üêºüå≥ Engenharia de Feautes com Pandas 


![Pandas](dados/944693_1_1029_panda_diplomacy_standard.jpg)

### O Que √© `pandas`?

> ### Python Data Analysis Library
> Um conjunto de ferramentas para an√°lise de dados em `Python`.

## 1. DataFrames
A estrutura de dados mais utilizada em `pandas` √© o [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html), que armazena os dados na forma de uma tabela. Os dados s√£o indexados pelas colunas ( _columns_ ) e pelas linhas ( _indexes_ ).

Existem v√°rias maneiras de declarar um `DataFrame`. Uma forma comum √© passar um dicion√°rio (`dict`) onde as chaves s√£o as colunas e os valores s√£o listas das linhas:

In [14]:
import pandas as pd
dados = {
    "bamboo": [0, 10, 20],
    "taquara": [5, 15, 25],
    "grama": [-1, -2, None],
}
pd.DataFrame(dados)

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN

Tamb√©m √© poss√≠vel passar apenas os valores e declarar as colunas no construtor do `DataFrame`:

In [16]:
dados = [[0, 5, -1], [10, 15, -2], [20, 25, None]]
pd.DataFrame(dados, columns=["bamboo", "taquara", "grama"])

   bamboo  taquara  grama
0       0        5   -1.0
1      10       15   -2.0
2      20       25    NaN

Provavelmente as formas mais utilizadas para carregar um `DataFrame` s√£o aquelas que carregam dados em disco. Entre os formatos suportados est√£o:
1. CSV
1. Excel
1. HDFS
1. JSON
1. Pickle
1. Parquet
1. SQL

In [18]:
df_train = pd.read_csv("dados/train.csv")
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df_test = pd.read_csv("dados/test.csv")
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

![Titanic](dados/titanic-movie-promo-stills-wallpaper-4.jpg)